backend/app/controllers/grids_controller.rb

SELECT "grids".* FROM "grids" WHERE "grids"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def find_grid
        @grid = Grid.find(params[:id])