backend/app/controllers/people_controller.rb

    def create
        buildings = Tile.all.filter do |tile|
        tile.property > 53 || tile.property == 46 || tile.property == 47
        end
        person = Person.create(person_params)
       4.times do
            Action.create({
              time: Faker::Number.between(from: 0, to: 1440),
              category: ["go to work","go to school","go shopping"][rand(3)],
              tile: buildings[rand(buildings.length)],
              person: person
            })
---
SELECT "tiles".* FROM "tiles"
SELECT "actions".* FROM "actions" WHERE "actions"."person_id" = ?  [["person_id", 166]]
INSERT INTO "actions" ("time", "created_at", "updated_at", "tile_id", "person_id", "category") VALUES (?, ?, ?, ?, ?, ?)  [["time", 1204], ["created_at", "2020-03-27 02:02:48.376035"], ["updated_at", "2020-03-27 02:02:48.376035"], ["tile_id", 1854], ["person_id", 166], ["category", "go to school"]]