backend/app/controllers/tiles_controller.rb

    def update
        tile = Tile.find(params[:id])
        tile.update(tile_params)
---
SELECT "tiles".* FROM "tiles" WHERE "tiles"."id" = ? LIMIT ?  [["id", 1713], ["LIMIT", 1]]
UPDATE "tiles" SET "property" = ?, "updated_at" = ? WHERE "tiles"."id" = ?  [["property", 58], ["updated_at", "2020-03-27 02:38:32.853824"], ["id", 977]]